# MemberId2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyDifferenceMemberDifference..::..MemberId2 Property
AssemblyDifferenceMemberDifference Class See Also
---
Id of the member in the second assembly
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId MemberId2 { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MemberId2 As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ MemberId2 {
	ElementId^ get ();
}
```

# See Also
AssemblyDifferenceMemberDifference Class
Autodesk.Revit.DB Namespace